Revit 2026 API

# FieldDomainPointsByParameter Class

---

Represents a set of one-dimensional point coordinates (defined usually on curve)

SystemObject Autodesk.Revit.DB.AnalysisFieldDomainPoints Autodesk.Revit.DB.AnalysisFieldDomainPointsByParameter

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FieldDomainPointsByParameter : FieldDomainPoints
```
```vb
Public Class FieldDomainPointsByParameter
	Inherits FieldDomainPoints
```
```cpp
public ref class FieldDomainPointsByParameter : public FieldDomainPoints
```
```fsharp
type FieldDomainPointsByParameter =
    class
        inherit FieldDomainPoints
    end
```

The FieldDomainPointsByParameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FieldDomainPointsByParameter | Initializes a new instance of the FieldDomainPointsByParameter class |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FieldDomainPoints) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FieldDomainPoints) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Analysis Namespace